[
    {
        
        "latar": "Aplikasi rekomendasi kursus online adalah solusi teknologi yang bertujuan untuk membantu pengguna menemukan kursus online yang sesuai dengan minat, tujuan, dan tingkat keterampilan mereka. Latar belakang dari perkembangan aplikasi semacam ini dapat dijelaskan sebagai berikut:.",
        "tujuan": "Adapun beberapa manfaat untuk pengguna dalam menggunakan aplikasi berbasis website ini, diantaranya :<br>1. Pengalaman pengguna dalam mencari resep yang lebih baik<br>2. Kemudahan akses pada resep yang berkualitas tinggi<br>3. Memberikan dukungan untuk pengembangan makanan yang lezat<br>4. Pengelolaan resep yang efisien<br>5. Memberikan inovasi dalam dunia kuliner" ,
        "manfaat": "1. Pengalaman pengguna dalam mencari resep yang lebih baik <br>2. Memberikan inovasi dalam dunia kuliner <br>3. Memberikan dukungan untuk pengembangan makanan yang lezat <br>3. Pengelolaan resep yang efisien <br>4. Kemudahan akses pada resep yang berkualitas tinggi",
        "landasan": "1. JavaScript Bahasa pemograman yang yang digunakan dalam pengembangan website agar lebih dinamis dan interaktif <br>2. Fiber Adalah kerangka kerja web yang Express yang dibangun di atas Fasthttp, mesin HTTP tercepat untuk Go.<br>3. RESTful API / REST API Merupakan implementasi dari API (Application Programming Interface). REST (Representional State Transfer) adalah suatu arsitektur metode komunikasi yang menggunakan protokol HTTP untuk pertukaran data dan metode ini sering diterapkan dalam pengembangan aplikasi.",
        "kesimpulan": "Dalam proposal ini, kami bertujuan untuk mengembangkan Aplikasi Resep Modern “Kitchped” yang akan memberikan manfaat signifikan bagi pengguna dan pengembang. Tujuan utama proyek ini adalah menggabungkan teknologi terkini, seperti JavaScript ES6+ untuk frontend dan Go Fiber untuk backend, dalam menciptakan pengalaman kuliner yang lebih baik. Dengan aplikasi ini, pengguna akan mendapatkan akses mudah ke resep berkualitas tinggi, dapat mengelola koleksi resep mereka dengan efisien. Di sisi lain, pengembang akan memiliki kesempatan untuk menguasai teknologi terbaru dalam pengembangan web, memperoleh pengalaman dalam merancang, mengembangkan, dan menguji aplikasi modern. Dengan potensi dampak yang besar, proyek ini diharapkan akan membawa inovasi dalam dunia kuliner, memudahkan akses ke resep berkualitas. Kesimpulannya, pengembangan Aplikasi Resep Modern ini memiliki tujuan yang jelas serta manfaat yang signifikan bagi pengembang maupun pengguna.",
        "anggota": "1. Aulia Maharani<br> Npm : 1214079<br> Kelas: D4 Teknik Informatika 3C<br>2. Firda Yulianti<br> Npm : 1214058 <br> Kelas: D4 Teknik Informatika 3C"

    }
]
